Tekla.Structures.Plugins.PluginBase.SymbolVisibility
Defines the symbol visibility for model plug-ins in model views.

Tekla.Structures.Plugins.PluginBase.SymbolVisibility.DRAW_SYMBOL
Symbol is visible in model view.

Tekla.Structures.Plugins.PluginBase.SymbolVisibility.DO_NOT_DRAW_SYMBOL
Symbol is not drawn to model view. Plug-in must be selected from the view using created objects only.